tap "chef/chef"
tap "fluxcd/tap"
tap "hashicorp/tap"
tap "mongodb/brew"
brew "age"
brew "openssl@3"
brew "ast-grep"
brew "readline"
brew "python@3.13"
brew "autojump"
brew "awscli"
brew "borgbackup"
brew "borgmatic"
brew "cairo"
brew "chezmoi"
brew "chruby"
brew "cloc"
brew "cmake"
brew "curl"
brew "gd"
brew "gmp"
brew "composer"
brew "coreutils"
brew "diff-so-fancy"
brew "direnv"
brew "docutils"
brew "exiftool"
brew "fcrackzip"
brew "fd"
brew "libidn2"
brew "felinks"
brew "ffmpeg"
brew "findent"
brew "fish"
brew "fzf"
brew "gawk"
brew "gdk-pixbuf"
brew "gh"
brew "harfbuzz"
brew "pango"
brew "ghostscript"
brew "git"
brew "go"
brew "gobject-introspection"
brew "netpbm"
brew "gts"
brew "librsvg"
brew "graphviz"
brew "handbrake"
brew "helm"
brew "node"
brew "heroku"
brew "hunspell"
brew "libheif"
brew "imagemagick"
brew "perl"
brew "irssi"
brew "jq"
brew "julia"
brew "k9s"
brew "kind"
brew "kubernetes-cli"
brew "krew"
brew "kustomize"
brew "lastpass-cli"
brew "lazygit"
brew "lftp"
brew "libyaml"
brew "luarocks"
brew "media-info"
brew "mercurial"
brew "mermaid-cli"
brew "mkvtoolnix"
brew "mtr"
brew "mysql"
brew "ncftp"
brew "neovim"
brew "openjdk"
brew "operator-sdk"
brew "pandoc"
brew "poppler"
brew "postgresql@16"
brew "postgresql@17", restart_service: :changed, link: true
brew "python@3.11"
brew "qt"
brew "rabbitmq", restart_service: :changed
brew "ruby-build"
brew "rbenv"
brew "rbenv-gemset"
brew "rbenv-vars"
brew "rclone"
brew "redis"
brew "rsync"
brew "ruby-install"
brew "rust"
brew "sloccount"
brew "sox"
brew "swiftlint"
brew "tfk8s"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "universal-ctags"
brew "uv"
brew "vapoursynth"
brew "victoriametrics"
brew "wakeonlan"
brew "wget"
brew "zsh"
brew "fluxcd/tap/flux"
brew "hashicorp/tap/consul"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "mongodb/brew/mongodb-community"
cask "1password-cli"
cask "android-studio"
cask "appcleaner"
cask "basictex"
cask "chef/chef/chefdk"
cask "docker-desktop"
cask "evernote"
cask "firefox"
cask "gcloud-cli"
cask "ghostty"
cask "github"
cask "google-drive"
cask "gpg-suite-no-mail"
cask "handbrake-app"
cask "iterm2"
cask "jdownloader"
cask "kitty"
cask "lastpass"
cask "little-snitch"
cask "macdown"
cask "makemkv"
cask "plex"
cask "postman"
cask "spotify"
cask "steam"
cask "swiftbar"
cask "the-unarchiver"
cask "todoist-app"
cask "vagrant"
cask "vlc"
cask "vorta"
cask "wezterm"
cask "whatsapp"
go "github.com/rhysd/actionlint/cmd/actionlint"
go "github.com/klauspost/asmfmt/cmd/asmfmt"
go "github.com/gobadiah/trading/trading-operator/cmd"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/kisielk/errcheck"
go "github.com/davidrjenni/reftools/cmd/fillstruct"
go "github.com/rogpeppe/godef"
go "golang.org/x/tools/cmd/goimports"
go "golang.org/x/lint/golint"
go "github.com/fatih/gomodifytags"
go "golang.org/x/tools/gopls"
go "golang.org/x/tools/cmd/gorename"
go "github.com/jstemmer/gotags"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/fatih/motion"
go "github.com/mgechev/revive"
cargo "ripgrep"
uv "osxphotos"
krew "rabbitmq"
npm "@delorenj/mcp-server-trello"
npm "mcp-hub"
npm "neovim"
npm "nextjs"
npm "openclaw"
